[
  {
    "id": 0,
    "title": "El ZEN de Javascript: a la búsqueda de la armonía del código",
    "thubnail": "",
    "pre": "<span style='color: #006600; font-style: italic;'>// Hermoso</span><span style='color: #000066; font-weight: bold;'>var</span> MODULE <span style='color: #339933;'>=</span><span style='color: #009900;'>(</span> <span style='color: #009900;'>(</span><span style='color: #009900;'>)</span> <span style='color: #339933;'>=&gt;</span> <span style='color: #009900;'>{</span><span style='color: #000066; font-weight: bold;'>var</span> my <span style='color: #339933;'>=</span> <span style='color: #009900;'>{</span><span style='color: #009900;'>}</span><span style='color:#339933;'>,</span>privateVariable <span style='color: #339933;'>=</span> <span style='color: #CC0000;'>1</span><span style='color: #339933;'>;</span>&nbsp;",
    "body": "Hace ya algunos años, Tim Peters enunció El ZEN de Python, un conjunto de recomendaciones cuyo objetivo era conseguir un código más limpio, mantenible y, en definitiva, cómodo para los desarrolladores. No se trata de un sistema rígido e inflexible, o de unas normas de estilo que hay que seguir a raja tabla, sino de una serie de aspectos que pueden ayudarnos a la hora de conseguir un código en armonía.No cabe duda de que Javascript comparte muchas características con Python, y es por ello que podemos adaptar el ZEN de Python a nuestro lenguaje sin muchas complicaciones. En este artículo, daremos un repaso a este manifiesto aportando ejemplos ilustrativos en JS.",
    "source": "http:\/\/www.etnassoft.com\/"
  },
  {
    "id": 1,
    "title": "Desestructuración en Javascript. Parte 2 (recetas y ejemplos)",
    "thubnail": "",
    "pre": "",
    "body": "En el anterior artículo revisamos la sintaxis, teoría y algunos ejemplos de esta nueva funcionalidad en ES6 que es la desestructuración.Vamos a completar ahora la teoría con muchos ejemplos, o recetas, más complejos que iremos comentando según sea necesario. ¡Vamos a ello!Combinando objetos y arrays. Como ya vimos, la desestructuración puede aplicarse sobre cualquier tipo de colección, ya sea un array, un objeto. Pero incluso podemos combinar ambos al mismo tiempo:",
    "source": "Carlos Benitez"
  },
  {
    "id": 2,
    "title": "Atajos (shortcuts) en la definición de métodos con ES6",
    "thubnail": "",
    "pre": "",
    "body": "Otra de las novedades del estándar ES6 son los atajos, o shortcuts, en la definición de métodos dentro de un objeto. Son un aspecto menor, pero ahorran espacio y hacen el código más legible y menos redundante en general. ¡Echemos un vistazo a esta nueva funcionalidad!",
    "source": "http:\/\/www.etnassoft.com\/"
  },
  {
    "id": 3,
    "title": "Las Funciones Flecha en Javascript. Parte 3",
    "thubnail": "",
    "pre": "",
    "body": "Para concluir esta introducción a las Funciones Flechas en el nuevo estándar ES6 (primera parte, segunda parte), no podemos dejar de repasar la correspondencia entre éstas y el método bind que ya hemos estudiado.Echemos un vistazo a cómo las nuevas estructuras pueden reemplazar de un modo limpio y directo a otras ya anticuadas…",
    "source": "http:\/\/www.etnassoft.com\/"
  }
]
